Tekla Open API Reference for Tekla Structures 2025
DistanceList.Add Method
 Adds the specified item at the end of the list.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void Add(
	Distance item
)
Public Sub Add (
	item As Distance
)
Parameters
item
Type: Tekla.Structures.Datatype.Distance
The item to be added.
Implements
ICollection<T>.Add(T)
Examples
 This example shows how to add a new Distance instance at the end of the DistanceList.
using Tekla.Structures.Datatype;
public class Example
{
       public void Example1()
       {
           Distance[] distances = { new Distance(30.2), new Distance(2.3) };
           DistanceList distanceList = new DistanceList(distances);
           // New distances can be added to the list using the DistanceList.Add method.
           distanceList.Add(new Distance(2));
           distanceList.Add(new Distance(40, Distance.UnitType.Inch));
       }
}
See Also
Reference
DistanceList Structure
Tekla.Structures.Datatype Namespace